ab_loadtest/load_test_stats.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.4.6
Server Hostname:        localhost
Server Port:            80

Document Path:          /accounts/login.html/
Document Length:        3601 bytes

Concurrency Level:      50
Time taken for tests:   277.239 seconds
Complete requests:      100000
Failed requests:        0
Non-2xx responses:      100000
Total transferred:      378100000 bytes
HTML transferred:       360100000 bytes
Requests per second:    360.70 [#/sec] (mean)
Time per request:       138.620 [ms] (mean)
Time per request:       2.772 [ms] (mean, across all concurrent requests)
Transfer rate:          1331.84 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0      20
Processing:    12  139   9.5    135     267
Waiting:       11  139   9.5    135     267
Total:         32  139   9.5    135     267

Percentage of the requests served within a certain time (ms)
  50%    135
  66%    138
  75%    140
  80%    142
  90%    148
  95%    156
  98%    167
  99%    175
 100%    267 (longest request)